Kaggle Data Science Competition: Passengers on Board the Titanic; Predictors for Survival

What were the best possible predictors of survival; cabin allocation 
* did distance of cabin from lifeboat promote increased chance of survival?
* what was the evacuation plan for the Titanic
* lifeboat capacity of Titanic was 1178 people
* 2208 passengers onboard
* 899 crew members
* majority of passengers unaware of iceberg collision (still asleep)
* no shipwide emergency announcement
* first and second class passengers sent to evacuate first
* once first and second class passengers accounted for then third class passengers were permitted onto upper decks for evacuation
* first class officer Murdoch ushered as many people as possible into life boats
* second class officer Toller only permitted women and children
* many third class passengers were lost in the downstairs areas due to not knowing proper evacuation route
* 12:15 a.m. collision occurred
* 2:20 a.m. ship sunk into Atlantic
* 1500 people died
* 705 people survived

![alt text](https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Titanic_cutaway_diagram.png/800px-Titanic_cutaway_diagram.png)

In [0]:
import numpy as np
import pandas as pd
import os

In [0]:
url_train = 'https://raw.githubusercontent.com/lannstoirme/kaggletitanicdatasets/master/train.csv'
url_test = 'https://raw.githubusercontent.com/lannstoirme/kaggletitanicdatasets/master/test.csv'
url_genderpredict = 'https://raw.githubusercontent.com/lannstoirme/kaggletitanicdatasets/master/gender_submission.csv'

In [27]:
train_data = pd.read_csv(url_train)
train_data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [28]:
test_data = pd.read_csv(url_test)
test_data.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [29]:
gender_predict = pd.read_csv(url_genderpredict)
gender_predict.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [30]:
# Percentage of female survivors from training data
women = train_data.loc[train_data.Sex == 'female']["Survived"]
rate_women = sum(women)/len(women)

print("% of women who survived :", rate_women)

% of women who survived : 0.7420382165605095

In [32]:
# Percentage of men who survived Titanic from training data
men = train_data.loc[train_data.Sex == 'male']["Survived"]
rate_men = sum(men)/len(men)

print("% of men who survided :", rate_men)

% of men who survided : 0.18890814558058924

In [45]:
#Construct a random forest prediction
from sklearn.ensemble import RandomForestClassifier

#y = train_data["Survived"]

#features = ["Pclass", "SibSp", "Parch", "Age"]
#X = pd.get_dummies(train_data[features])
#X_test = pd.get_dummies(test_data[features])

#model = RandomForestClassifier(n_estimators=50, max_depth=2, random_state=1)
#model.fit(X, y)
#predictions = model.predict(X_test)

#output = pd.DataFrame({'PassengerId': test_data.PassengerId, 'Survived': predictions})
#output.to_csv('KaggleSubmission.csv', index=False)
#print("Your submission was successfully saved")

#from sklearn.ensemble import RandomForestClassifier

y = train_data["Survived"]

features = ["Pclass", "Sex", "SibSp", "Parch", "Embarked"]
X = pd.get_dummies(train_data[features])
X_test = pd.get_dummies(test_data[features])

model = RandomForestClassifier(n_estimators=500, max_depth=10, random_state=45)
model.fit(X, y)
predictions = model.predict(X_test)

output = pd.DataFrame({'PassengerId': test_data.PassengerId, 'Name': test_data.Name, 'Survived': predictions})
output.to_csv('my_submission.csv', index=False)
print("Your submission was successfully saved!")

Your submission was successfully saved!